---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RoofCurveIsSlopeDefining
source: html/9bb7ff1b-8d25-037c-3fa9-9b0aa31854dd.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RoofCurveIsSlopeDefining Property

"Defines Roof Slope"

## Syntax (C#)
```csharp
public static ForgeTypeId RoofCurveIsSlopeDefining { get; }
```